/* 1063764	840502	1499	Accepted	34968 kb	1224 ms	C++/Edit	2409 B	2015-08-04 23:28:17 */
#include<bits\stdc++.h>
using namespace std;
int mx[] = { 1,-1,0,0 };
int my[] = { 0,0,1,-1 };
int n, m, x, y, K;
char str[205][205];
int DP[205][205][205];
void cal(int time, int dir, int interval) {
  int end, step;
  int Q[405], L, R;
  if (dir == 0 || dir == 1) {
    for (int i = 1; i <= m; i++) {
      if (dir == 0)
        end = 0, step = -1;
      else
        end = n + 1, step = 1;
      L = R = 0;
      for (int j = (dir == 0) ? n : 1; j != end; j += step) {
        if (DP[time - 1][j][i] != -1) {
          while (L<R && DP[time - 1][j][i] > DP[time - 1][Q[R - 1]][i] + abs(j - Q[R - 1])) R--;
          Q[R++] = j;
        }
        while (L < R && (abs(j - Q[L]) > interval || str[j][i] == 'x')) L++;
        if (L < R)
          DP[time][j][i] = DP[time - 1][Q[L]][i] + abs(j - Q[L]);
      }
    }
  }
  else {
    for (int i = 1; i <= n; i++) {
      if (dir == 2)
        end = 0, step = -1;
      else
        end = m + 1, step = 1;
      L = R = 0;
      for (int j = (dir == 2) ? m : 1; j != end; j += step) {
        if (DP[time - 1][i][j] >= 0) {
          while (L < R && DP[time - 1][i][j] > DP[time - 1][i][Q[R - 1]] + abs(j - Q[R - 1]))  R--;
          Q[R++] = j;
        }
        while (L<R && (abs(j - Q[L]) > interval || str[i][j] == 'x'))  L++;
        if (L < R)
          DP[time][i][j] = DP[time - 1][i][Q[L]] + abs(j - Q[L]);
      }
    }
  }
}
int main() {
  scanf("%d%d%d%d%d", &n, &m, &x, &y, &K);
  for (int i = 1; i <= n; i++)
    scanf("%s", str[i] + 1);
  memset(DP, -1, sizeof(DP));
  DP[0][x][y] = 0;
  for (int i = 1; i <= K; i++) {
    int a, b, dir;
    scanf("%d%d%d", &a, &b, &dir);
    cal(i, --dir, b - a + 1);
  }
  int ans = 0;
  for (int i = 1; i <= n; i++)
    for (int j = 1; j <= m; j++)
      ans = max(DP[K][i][j], ans);
  printf("%d\n", ans);
  return 0;
}
/*

1499: [NOI2005]瑰????

Time Limit: 3 Sec  Memory Limit: 64 MB
Submit: 1115  Solved: 660
[Submit][Status][Discuss]
Description

你跳?????？?音??起，?你??旋律滑?舞步，是不是有一种漫步仙境的?意？?所周知，跳????，最重要的是有好的音?。但是很少有几?人知道，世界上最?大的?琴家一生都漂泊在大海上，他的名字叫丹尼?布德曼?T.D.??檬?1900，朋友?都叫他1900。 1900在20世?的第一年出生在往返于?美的??弗吉尼??上，很不幸他?出生就被??了，成了孤儿。1900孤?的成?在弗吉尼??上，?未离?????晃的世界。也?是?他命?的??，上帝派可?的小天使艾米?照?他。可能是天使的?化，1900?有不可思?的?琴天?：?未有人教，??看???，但他?能??自己的感??出最沁人心脾的旋律。?1900的音??得??上所有人的?迎?，他才8?，而此?的他已?乘?海?往返?美大?50余次了。??是?琴奇才，但1900?是?孩子，他有?和一般男孩一?的好奇和?皮，只不?更多一?浪漫的色彩?了：?是一??雨交加的夜晚，海?卷起??巨浪拍打?弗吉尼??，????巨浪?烈的??。船上的新?克斯手?克斯?托尼?船了，1900招呼托尼和他一起坐上舞?里的?琴，然后松?了固定?琴的?，于是，?琴??海?的?斜滑?起?。准确的?，我?的主角1900、?琴、????1900的旋律一起跳起了???，??“?嚓嚓”的?奏，托尼的?船症也奇?般的消失了。后?托尼在回??上?道：大海?晃?我?使我????去快速的掠??和家具我意?到我?正在和大海一起跳舞真是完美而?狂的舞者晚上在金色的地板上快?的跳????是不是很?意呢？也?，我?忘?了一?人，那就是艾米?，她可???：她必?在适?的?候施展魔法?助1900，不??琴碰上舞?里的家具。不妨??舞?是一?N行M列的矩?，矩?中的某些方格上堆放了一些家具，其他的?是空地。?琴可以在空地上滑?，但不能撞上家具或滑出舞?，否???坏?琴和家具，引???的船?。每??刻，?琴都???船体?斜的方向向相?的方格滑?一格，相?的方格可以是向?、向西、向南或向北的。而艾米?可以??施魔法或不施魔法：如果不施魔法，??琴?滑?；如果施魔法，??琴?原地不?。艾米?是?天使，她知道每段??的船体的?斜情?。她想使?琴在舞?里滑行路程?量?，??1900?非常高?，同?也有利于治?托尼的?船。但艾米??太小，不?算，所以希望你能?助她。

Input

?入文件的第一行包含5??N, M, x, y和K。N和M描述舞?的大小，x和y??琴的初始位置（x行y列）；我??船体?斜情?是按??的???描述的，且?1?始?量??，比如“在[1, 3]??里向??斜，[4, 5]??里向北?斜”，因此?里的K表示??的?目。以下N行，每行M?字符，描述舞?里的家具。第i行第j列的字符若?‘ . ’，?表示?位置是空地；若?‘ x ’，?表示有家具。以下K行，?序描述K?????，格式?：si ti di。表示在????[si, ti]?，船体都是向di方向?斜的。di?1, 2, 3, 4中的一?，依次表示北、南、西、?（分???矩?中的上、下、左、右）。?入保???是??的，即 s1 = 1 si = ti-1 + 1 (1 < i ? K) tK = T

Output

?出文件?有1行，包含一?整?，表示?琴滑行的最?距离(即格子?)。

Sample Input

4 5 4 1 3
..xx.
.....
...x.
.....
1 3 4
4 5 1
6 7 3

Sample Output

6

HINT

Source

Dp优化

*/